# -*- coding: utf-8 -*-
"""Untitled29.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Jj-inisbdkp1z-1URWwk2hhjXNqSMgfk

Расчет экономической эффективности внедрения системы DISC для организации на Python
"""

import numpy as np

# Входные данные
current_cost_per_patient = 200  # Средняя стоимость обслуживания одного пациента (в рублях)
num_patients = 500  # Количество пациентов в месяц
staff_costs = 300000  # Общая зарплата персонала (в рублях)
error_costs = 50000  # Потери из-за ошибок (в рублях)

# Затраты на внедрение DISC
disc_implementation_cost = 1500000  # Стоимость внедрения (в рублях)
annual_maintenance_cost = 200000  # Годовые затраты на поддержку

# Эффекты от внедрения
time_saving = 0.2  # Снижение времени обработки (20%)
error_reduction = 0.3  # Снижение числа ошибок (30%)
patient_increase = 0.15  # Увеличение числа пациентов (15%)

# Расчеты
new_cost_per_patient = current_cost_per_patient * (1 - time_saving)
new_error_costs = error_costs * (1 - error_reduction)
new_num_patients = num_patients * (1 + patient_increase)

# Выгоды от внедрения
monthly_savings = (current_cost_per_patient - new_cost_per_patient) * new_num_patients + (error_costs - new_error_costs)
annual_savings = monthly_savings * 12

# ROI и срок окупаемости
roi = (annual_savings - annual_maintenance_cost - disc_implementation_cost) / disc_implementation_cost * 100
payback_period = disc_implementation_cost / (annual_savings - annual_maintenance_cost)

# Вывод результатов
print(f"Годовая экономия: {annual_savings:.2f} руб.")
print(f"ROI: {roi:.2f}%")
print(f"Срок окупаемости: {payback_period:.2f} лет")